posts/tensorflow-key-concepts/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>使用 Tensorflow 建模，你需要理解的三个概念 | Astropeak</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://astropeak.github.io/" title="Astropeak" rel="home">Astropeak</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">Astropeak</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
                    <li><a href="http://github.com/astropeak">Github</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">May 18, 2018</a>
            </span>
        </div>
        <h1>使用 Tensorflow 建模，你需要理解的三个概念</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <p>
使用Tensorflow的基本套路是，先建立一个问题的模型，然后求解模型的参数。
建立模型要涉及到占位符（Placeholder）和变量（Variable），求解模型参数涉及优化器。
因此，只要理解了这三个概念，我们便可以使用Tensorflow构建自己的模型并求解模型的参数。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">占位符（Placeholder）</h2>
<div class="outline-text-2" id="text-1">
<p>
使用 tf.placeholder 来创建一个占位符，创建时需要指定它的类型。
比如我们要建立一个数学公式 2x<sup>2</sup> + 3x + 1，此时就需要将x定义为一个占位符。这样我们才能在求解公式的值时，动态地指定x的值。
</p>

<div class="highlight"><pre>
<span></span><span class="kn">import</span> <span class="nn">tensorflow</span> <span class="kn">as</span> <span class="nn">tf</span>

<span class="codeH"><span class="n">x</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">placeholder</span><span class="p">(</span><span class="n">tf</span><span class="o">.</span><span class="n">int32</span><span class="p">)</span> <span class="c1"> </span></span>  <span class="numberCircle unselectable">1</span>
<span class="codeH"><span class="n">y</span> <span class="o">=</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">3</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span> <span class="c1"></span></span>  <span class="numberCircle unselectable">2</span>

<span class="n">sess</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">Session</span><span class="p">()</span>
<span class="codeH"><span class="n">r</span> <span class="o">=</span> <span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">y</span><span class="p">,</span> <span class="n">feed_dict</span><span class="o">=</span><span class="p">{</span><span class="n">x</span><span class="p">:</span><span class="mi">2</span><span class="p">})</span> <span class="c1"></span></span>  <span class="numberCircle unselectable">3</span>
</pre></div>
<ul class="org-ul">
<li>
<b>1</b> ：创建一个占位符，其类型为int32
</li>
<li>
<b>2</b> ：定义数学公式。其中自变量为x，函数值为y
</li>
<li>
<b>3</b> ：求解给定自变量x为2时，函数值y的值。通过 <code>feed_dict</code> 参数指定一个占位符的值。
运行过后，r的值为15（2*2<sup>2</sup> + 3*2 + 1）
</li>
</ul>
<p>
占位符有点像编程语言中变量的概念，但关键不同为：占位符不会保存值，当指定一个值给它后，它并不会将这个值保存起来，以便下次使用。而是你每次使用它时，都必须为它指定一个新值。而变量则会将上次的值一直保存，下次使用时你不必再指定新值，它会直接使用上次保存的值。
</p>

<p>
一个数学公式中的自变量正好需要这样：它本身没有状态（即不会保存上次的值），你每次求解公式的值时，都必须指定自变量的值。所以，占位符的作用为：
</p>

<blockquote>
<p>
占位符提供了一种给模型指定自变量值的机制
</p>
</blockquote>

<p>
一个基本规则为，在使用Tensorflow建模时，将模型的自变量和因变量定义为占位符，这就对了。
</p>

<p>
如果一个模型中包含了占位符，则在求解这个模型值时，Tensorflow会强制必须指定所有占位符的值，通过 <code>feed_dict</code> 。如上面例子所示，在求解y时，必须指定x的值。
</p>

<p>
如果没有指定x的值，如下所示：
</p>
<div class="highlight"><pre>
<span></span><span class="n">r</span> <span class="o">=</span> <span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">y</span><span class="p">)</span>
</pre></div>
<p>
则会报一个错误：
</p>
<div class="highlight"><pre>
<span></span>You must feed a value for placeholder tensor \'Placeholder\' with dtype
</pre></div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">关于 <code>feed_dict</code> 参数</h3>
<div class="outline-text-3" id="text-1-1">
<p>
这个参数指定所有占位符的值。为一个dict。每个key指定的一个占位符的值。key值为占位符本身，如例子中的x，对应的值为占位符的值。
</p>

<p>
当模型中包含占位符时，则在求解模型值时，必须使用 <code>feed_dict</code> 来指定所有占位符的值。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">关于 sess.run</h3>
<div class="outline-text-3" id="text-1-2">
<p>
这个函数用于求解一个结点的值。
</p>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">变量（Variable）</h2>
<div class="outline-text-2" id="text-2">
<p>
使用tf.Variable创建一个变量。变量跟编程语言中的变量的概念非常相似，表示一个存储空间，能够保存一个值。变量在使用必须有一个初始值，你可以改变一个变量的值。
</p>

<p>
使用Tensoflow创建机器学习模型时，变量被用于表示模型的参数。一般来说，训练机器学习模型的过程，就是寻找模型参数的过程。在训练开始前，都会给参数一个初始值，然后逐渐修改变量的值，使得模型能够逼近训练数据。
</p>

<p>
以下是使用变量的一个例子。
</p>
<div class="highlight"><pre>
<span></span><span class="n">a</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">Variable</span><span class="p">(</span><span class="mi">3</span><span class="p">,</span> <span class="n">name</span><span class="o">=</span><span class="s1">'my_a'</span><span class="p">)</span>
<span class="n">b</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">constant</span><span class="p">(</span><span class="mi">3</span><span class="p">)</span>
<span class="n">c</span> <span class="o">=</span> <span class="n">a</span><span class="o">*</span><span class="n">b</span>

<span class="c1"># a variable must be initilized</span>
<span class="n">init</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">global_variables_initializer</span><span class="p">()</span>
<span class="bp">self</span><span class="o">.</span><span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">init</span><span class="p">)</span>
<span class="n">r</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">c</span><span class="p">)</span> <span class="c1"># r=9</span>
</pre></div>

<p>
变量在使用必须被初始化，通过调用 tf.global<sub>variables</sub><sub>initializer</sub>()
来实现。如果没有初始化，则会报下面的错误。
</p>

<div class="highlight"><pre>
<span></span>Attempting to use uninitialized value my_a
</pre></div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">修改变量的值</h3>
<div class="outline-text-3" id="text-2-1">
<p>
通过变量的 assign
函数来修改它的值。如下所示。
</p>
<div class="highlight"><pre>
<span></span><span class="n">a</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">Variable</span><span class="p">(</span><span class="mi">3</span><span class="p">,</span> <span class="n">name</span><span class="o">=</span><span class="s1">'my_a'</span><span class="p">)</span>
<span class="n">init</span> <span class="o">=</span> <span class="n">tf</span><span class="o">.</span><span class="n">global_variables_initializer</span><span class="p">()</span>
<span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">init</span><span class="p">)</span>
<span class="k">assert</span><span class="p">(</span><span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">a</span><span class="p">)</span> <span class="o">==</span> <span class="mi">3</span><span class="p">)</span>

<span class="n">assign_to_4</span> <span class="o">=</span> <span class="n">a</span><span class="o">.</span><span class="n">assign</span><span class="p">(</span><span class="mi">4</span><span class="p">)</span>
<span class="c1"># Before run the operation, a is still 3. This is a little hard to understand</span>
<span class="k">assert</span><span class="p">(</span><span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">a</span><span class="p">)</span> <span class="o">==</span> <span class="mi">3</span><span class="p">)</span>
<span class="n">r</span> <span class="o">=</span> <span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">assign_to_4</span><span class="p">)</span>
<span class="k">assert</span><span class="p">(</span><span class="n">sess</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">a</span><span class="p">)</span> <span class="o">==</span> <span class="mi">4</span><span class="p">)</span>
</pre></div>

<p>
但在训练机器学习模型时，并不需要自己修改变量的值，优化器会自动修改。
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">优化器（Optimizer）</h2>
<div class="outline-text-2" id="text-3">
<p>
当使用占位符和变量构造好模型及目标函数后，便可使用优化来求解模型的参数。使用占位符表示模型的自变量和因变量（即模型的X，Y），使用变量表示模型的参数。
</p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">总结</h2>
<div class="outline-text-2" id="text-4">
<p>
使用Tenforflow建模时，将模型的自变量和因变量定义为占位符（Placeholder），这样我们可以动态地指定自变量和因变量的值。
</p>

<p>
将模型的参数指定为变量（Variable），并给定一个初值，这样Tensorflow在求解模型参数过程中，其可以不断修改参数的值，直到模型能够和数据点吻合。
</p>

<p>
优化器是Tensorflow求解模型的工具，梯度下降是一种常用的优化器。</p>
</div>
</div>
            </div>
        </article>
</div>

        <!-- Tag Section -->
    <div class="site-content navigation-post">
        <div class="tag-head">Tags</div>
        <div class="tag-list">
                <a href="../../categories/tensorflow/">tensorflow</a>
        </div>
    </div>

        <!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
            <a href="../ascii-unicode-and-utf8/" rel="prev">
                <span class="meta-nav">Older Post</span>ASCII、 Unicode 和 UTF8
            </a>
        </div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
            <aside class="widget"><h2 class="widget-title">Astropeak</h2>
                <div class="widget-text">Astropeak's blogs.</div>
            </aside>
</div>
    </section><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
            <p>Contents © 2018         <a href="mailto:astropeak@gmail.com">Astropeak</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
        </div>
        <div class="social">
            <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>
